Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException
The exception that is thrown when the specified file exists.